<template>
  <div class="slider-container">
    <button @click="showSlider">划出侧边栏</button>
    <div>只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容只是内容</div>
    <div class="layer" v-show="isShowLayer" @click="hideSlider"></div>
      <div class="left-slider" ref="lefSilder">
        <header class="header"></header>
        <div class="content-wrapper">
          <ul>
            <li>首页</li>
            <li>个人中心</li>
            <li>菜单栏</li>
          </ul>
        </div>
      </div>
  </div>
</template>

<script>
  export default {
    data() {
      return {
        isShowLayer: false
      }
    },
    methods: {
      showSlider() {
        this.isShowLayer = true;
        let dom = this.$refs.lefSilder;
        dom.style.left = 0;
      },
      hideSlider() {
        let dom = this.$refs.lefSilder;
        dom.style.left = '-5rem';
        this.isShowLayer = false;
      }
    }
  }
</script>

<style lang="stylus" scoped>
.slider-container
  width 100%
  height 100%
  position relative
  font-size 16px
  .layer
    width: 100%;
    height: 100%;
    background: rgba(0,0,0,.1)
    position fixed
    top 0
    left 0
    z-index 10
  .left-slider
    font-size 18px
    width 5rem
    height 100%
    position absolute
    top 0
    left -5rem
    z-index 11
    background #fff
    transition left linear .3s
    .header
      width 1rem
      height 1rem
      border-radius 50%
      background blue
</style>